Revit 2027 API
RebarConstraint.ReplaceReferenceTargets Method
Overload List
Name | Description
ReplaceReferenceTargets(IList<Reference>, RebarConstraintType) |  Replaces the current set of references, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
ReplaceReferenceTargets(RebarConstrainedHandle, IList<Reference>, Boolean, Double) | Obsolete.
 Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
Top
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace